Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: གལ་ཏེ་ཁྱོད་བསྐལ་པ་བརྒྱད་དམ་བཅུས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་ན་ཕྱིས་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་ནུས་སོ་ཞེས་མཆི་ལ།
en: If after eight or ten eons one still has not fully awakened to unsurpassed and perfect buddhahood, one might think that one is unable to fully awaken to unsurpassed and perfect buddhahood.

source: བཅོམ་ལྡན་འདས་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་གང་སྒྱིད་ལུག་ནས་འབྲས་བུ་ཐོབ་པར་བགྱིད་པའི་གནས་མཆིས་ནབཅོམ་ལྡན་འདས་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའི་བཤེས་གཉེན་ལྟར་བཅོས་པའི་བདུད་ཀྱི་ལྕགས་ཀྱུ་སྟེ་བཅུ་པའོ། །
en: However, Blessed One, if a bodhisattva is hoping to attain the fruition through procrastination, then this is the tenth hook of Māra, related to bodhisattvas pretending to be spiritual friends.

source: བཅོམ་ལྡན་འདས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ང་རྒྱལ་གྱིས་ཁེངས་ཤིང་ང་རྒྱལ་གྱིས་རེངས་པར་གྱུར་ཏེ། དེ་ང་རྒྱལ་དེས་བླ་མ་རྣམས་དང་། སྦྱིན་གནས་རྣམས་དང་། ཕ་མ་དང་། སློབ་དཔོན་དང་། མཁན་པོ་རྣམས་དང་། དེ་ལས་གཞན་པ་བླ་མ་ལྟ་བུའི་གང་ཟག་རྣམས་ལ་ཀུན་ཏུ་འདུད་པ་དང་།
en: “Blessed One, moreover, bodhisattvas who are hardened and inflated by pride will, because of their pride, fail to bow before, prostrate to, or show respect to their masters, honorable ones, parents, teachers, preceptors, or other people in such positions.

source: འདུད་པ་དང་། རབ་ཏུ་འདུད་པར་མི་བགྱིད་ཅིང་དེ་ལ་མ་གུས་པར་གྱུར་པ་དང་། གང་དག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྣམས་ལ་མཁས་པ། ཁྱད་པར་ཐོབ་པ། གཟུངས་དང་སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ། བྱང་ཆུབ་སེམས་དཔའི་བགྱི་བ་ཐམས་ཅད་ཚར་ཕྱིན་པ་དེ་དག་གི་གན་དུ་མི་མཆི། མི་བསྙེན། མི་བསྟེན། བསྙེན་བཀུར་མི་བགྱིད། ཡོངས་སུ་མི་འདྲི།
en: They will not care to stay near to, attend to, rely upon, serve, discuss with, or inquire of those who are learned in the practices of bodhisattvas, who have reached distinction, who have perfect recollection and eloquence, or who have perfected all bodhisattva deeds.

source: ཡོངས་སུ་འདྲིར་མི་སྩོལ་ཅིང་དེ་མ་ཐོས་པའི་ཆོས་ཉན་པར་མི་བགྱིད། ཐོས་པའི་ཆོས་རྣམས་ཀྱང་ཡོངས་སུ་དཀར་བར་མི་བགྱིད།
en: As such, they will of course not hear the teachings that they do not listen to, but they will even be disinterested in those teachings that they do hear.

source: དེ་ལས་གཞན་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་གང་ཟག་གང་དག་བདུད་ཀྱི་ལྕགས་ཀྱུས་ཟིན་པ།
en: In other ways as well, such people of the bodhisattva vehicle are caught by the hook of Māra.

source: ཆོས་ངན་པ་ལ་སྤྱོད་པ་དེ་དག་ལ་དགའ་བ་རྙེད་པ་དང་། དེ་དག་ཀྱང་དེ་བཞིན་དུ་དེའི་རྗེས་སུ་འཇུག་པར་གྱུར་པ་དང་།
en: They are fond of those who engage in negative qualities and they even follow in their footsteps.

source: དེ་དམན་པ་ལ་སྟེན་ཅིང་། ཁྱད་པར་དང་བྲལ་བ་འདི་ལྟ་སྟེ་ཞན་པའི་འགྲོ་བ།
en: They follow the lowly and lose any distinction.

source: བླུན་པ། འོན་པ། ལྐུགས་པའི་འགྲོ་བ། འགྲོ་བ་དམན་པ་ཉིད་དུ་མཆི་བར་འགྱུར་རོ། །
en: Thus they become weak, stupid, deaf, dumb, and inferior.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུ་ལ་ལ་ཞིག་གིས་གྲམ་པའི་ས་ཕྱོགས་སུ་ཤིང་ཙམ་པ་ཀ་བསྐྲུན་ལ་ཆབ་སྩོལ་བར་མི་བགྱིད་ཀྱི། གང་ནས་ཆབ་མཆི་བར་མཐོང་བའི་ཕྱོགས་དེར་ཡང་གོར་མ་དང་གྱོ་མོ་དག་གིས་བཀུམ་ན།
en: “Blessed One, to draw an analogy, if a person plants a magnolia tree in the vicinity of a riverbed, yet fails to channel water to it, the tree will wither among the pebbles and gravel in what otherwise would seem like a place with water.

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་ན་ཞུགས་ཤིང་ཙམ་པ་ཀ་ཆབ་དང་བྲལ་བ་དེ་ལ་ཡལ་ག་དང་ལོ་མ་དང་ཡལ་ག་ཕྲེའུ་མ་ཆགས་པ་རྣམས་ཀྱང་ཆགས་པར་མི་འགྱུར།
en: Blessed One, as the magnolia tree is lacking water, it will not grow branches, leaves, or twigs.

source: ཡལ་ག་དང་ལོ་མ་དང་ཡལ་ག་ཕྲེའུ་ཆགས་པ་རྣམས་ཀྱང་སྐམས་ཏེ་དོག་ས་ལ་ལྷུང་བར་འགྱུར་རོ། །
en: The branches, leaves, and twigs will dry up and fall to the ground.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་གང་བྱང་ཆུབ་ཀྱི་སེམས་བསྐྱེད་ལ་ང་རྒྱལ་གྱིས་ཁེངས་ཤིང་ང་རྒྱལ་གྱིས་རེངས་པར་གྱུར་ན། དེ་དགེ་བའི་བཤེས་གཉེན་དང་ཆོས་མཉན་པ་དང་བྲལ་ཏེ།
en: Blessed One, likewise, bodhisattvas who have developed the mind of awakening but are hardened and inflated by pride will lack spiritual friends and opportunities to study the Dharma.

source: མ་ཐོས་པའི་ཆོས་རྣམས་ཀྱང་མི་ཉན། ཐོས་པའི་ཆོས་རྣམས་ཀྱང་ཡོངས་སུ་དཀར་བར་མི་བགྱིད་དོ། །
en: They will of course not hear the teachings that they do not listen to, but they will even be disinterested in those teachings that they do hear.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན།
en: “Blessed One, to draw another analogy,

source: གང་གི་ཚེ་རྒྱ་མཚོ་ཆེན་པོ་མཆིས་པར་གྱུར་པ་དེའི་ཚེ་གཞོལ་བའི་ཕྱོགས་ན་མཆིས་པར་འགྱུར་རོ། །དེ་གཞོལ་བའི་སླད་དུ་ཆུ་ཀླུང་ཐམས་ཅད་དང་ཆབ་མིག་དང་། འབབ་ཆུ་ཐམས་ཅད་ཚེགས་ཆུང་ངུས་དེར་འབབ་བོ། །
en: the ocean is always in low-lying areas. Because it is low-lying, all rivers, springs, and waterfalls naturally flow there.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ང་རྒྱལ་མ་མཆིས་པ་བླ་མ་དང་། སྦྱིན་གནས་ལ་གུས་པ་ཡང་ཚེགས་ཆུང་ངུས་ཆོས་ཟབ་མོའི་སྒོ་རྣམས་རྣ་བའི་དབང་པོ་ལ་གྲགས་པར་འགྱུར་རོ། །དེ་དྲན་པ་ལ་ཡང་གནས་པར་འགྱུར་རོ། །
en: Blessed One, likewise, humble bodhisattvas will respect their masters and honorable ones, and naturally hear the gateways to the profound Dharma with their ear faculty while maintaining mindfulness.

source: བཅོམ་ལྡན་འདས་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་ང་རྒྱལ་གྱིས་ཁེངས་ང་རྒྱལ་གྱིས་རེངས་པར་གྱུར་ཏེ། བླ་མ་དང་སྦྱིན་གནས་རྣམས་ལ་ཀུན་ཏུ་མི་འདུད་ཅིང་འདུད་པར་མི་བགྱིད་ལ་རབ་ཏུ་མི་འདུད་ན། བཅོམ་ལྡན་འདས་ཀྱེ་མའོ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ནི་བདུད་ཀྱི་ལྕགས་ཀྱུས་ཟིན་པར་རིག་པར་བགྱི་སྟེ།
en: Blessed One, therefore, if a bodhisattva who is hardened and inflated by pride cannot bow before, bend before, prostrate to, or show respect to their masters and honorable ones, then it should be known that they have been caught by the hook of Māra.

source: བཅོམ་ལྡན་འདས་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ང་རྒྱལ་དང་རབ་ཏུ་ལྡན་པའི་བདུད་ཀྱི་ལྕགས་ཀྱུ་སྟེ་བཅུ་གཅིག་པའོ། །
en: Blessed One, this is the eleventh hook of Māra, related to a bodhisattva’s pride.

source: བཅོམ་ལྡན་འདས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གཟུགས་བཟང་ཞིང་མཛེས་ལ་ཕྱུག་ཅིང་ནོར་ཆེ་བ་དང་། ལོངས་སྤྱོད་ཆེ་བ་ནོར་མང་ལ་མཛོད་དང་བང་བ་མང་པོ་ཕུན་སུམ་ཚོགས་པར་གྱུར་ཏེ་
en: “Blessed One, there are some bodhisattvas who are good looking, beautiful, rich, affluent, and prosperous; who have many resources, and abundant treasuries and storehouses;

source: གཟུགས་དང་། ལོངས་སྤྱོད་དང་། རུས་དང་། རིགས་དང་། གཡོག་འཁོར་དང་། བསོད་ནམས་ཀྱི་ཚོགས་ཀྱིས་བརྟན་པར་གྱུར།
en: who are secure in terms of their good looks, wealth, bloodline, caste, servants, and accumulations of merit;

source: ཡེ་ཤེས་ཀྱི་ཚོགས་ཡོངས་སུ་བཙལ་བ་ལ་མངོན་པར་བརྩོན་ཞིང་
en: and who diligently pursue the accumulation of wisdom.

source: དེ་གཟུགས་དང་། ལོངས་སྤྱོད་དང་། གཡོག་འཁོར་དང་། དབང་ཕྱུག་གི་སྟོབས་ཀྱིས་རྒྱགས་ཤིང་བག་མ་མཆིས་པར་གྱུར་ཏེ།
en: Such bodhisattvas could become arrogant and careless due to their good looks, wealth, servants, and power.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་དག་རབ་ཏུ་བྱུང་བར་གཏོགས་པ་ཁྱིམ་གྱི་གནས་ནས་མངོན་པར་བྱུང་བ།
en: When they see ordained bodhisattvas who have left the household life;

source: ཡེ་ཤེས་ཀྱི་ཚོགས་ཡོངས་སུ་ཚོལ་བ་ལ་བརྩོན་པ།
en: who are diligent in the pursuit of the accumulation of wisdom;

source: གདུགས་དང་བསེར་མས་ཤ་དང་ཁྲག་བསྐམས་པ།
en: whose flesh and blood have withered due to heat and cold;

source: རྐེ་བ། ཉམ་ཆུང་བ། ལུས་རྩས་ཡོག་པ།
en: who are emaciated, weak, and skinny;

source: མགོ་དང་གོས་ལ་ཞུགས་འབར་བ་བཞིན་དུ་གདུགས་མཚན་དུ་བརྩོན་འགྲུས་བརྩམས་པ།
en: who practice diligently day and night as if their head and clothes were on fire;

source: དགེ་བའི་ཆོས་ཡོངས་སུ་ཚོལ་བ་ལ་རྟག་ཏུ་བརྩོན་པ་དང་ལྡན་པ་དེ་དག་ལ་རྐེ་ཞིང་ཉམ་ཆུང་ལ་མདོག་ངན་ཅིང་མི་སྡུག་པར་རིག་ནས་བརྙས་པར་བྱའོ་སྙམ་དུ་སེམས་ཤིང་།
en: and who show constant exertion in the pursuit of virtuous qualities, they will think of them as thin, feeble, unattractive, and ugly beings who are worthy of contempt.

source: དེ་དག་ལས་ལེགས་པར་བཤད་པ་ཉན་པར་མི་འཚལ་གྱི་དེ་དེ་བས་ཤས་ཆེར་དམན་ཞིང་ཆེས་རྨུགས་པར་འགྱུར་བ་འདི་ནི།
en: They are not interested in receiving any advice from them, and they even consider them more lowly and deluded than themselves.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་རྒྱགས་པ་དང་བག་མ་མཆིས་པ་དང་རབ་ཏུ་ལྡན་པའི་བདུད་ཀྱི་ལྕགས་ཀྱུ་སྟེ་བཅུ་གཉིས་པའོ། །
en: Blessed One, this is the twelfth hook of Māra, related to a bodhisattva’s arrogance and carelessness.

source: བཅོམ་ལྡན་འདས་བཅུ་གཉིས་པོ་དེ་དག་ནི། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བདུད་ཀྱི་ལྕགས་ཀྱུ་སྟེ།
en: “Blessed One, these twelve are Mara’s hooks reserved for bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལས་ཤིན་ཏུ་མ་འདས་ན་ཐ་ན་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ཡང་མི་འཐོབ་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ་ཏེ་
en: If bodhisattvas do not escape them, they will not attain even acceptance conducive to awakening, so forget about fully awakening to unsurpassed and perfect buddhahood.

source: དེ་ནི་གནས་མ་མཆིས་སོ། །
en: It would be impossible.

source: བཅོམ་ལྡན་འདས་དེ་ལྟ་བས་ན། བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འཚལ་བས་བདུད་ཀྱི་ལྕགས་ཀྱུ་འདི་དག་ལས་ཤིན་ཏུ་འདའ་བར་བགྱིའོ།། །།
en: Therefore, Blessed One, it is by striving to fully awaken to unsurpassed and perfect buddhahood that a bodhisattva will escape these hooks of Māra.”

source: འཕགས་པ་བློ་གྲོས་རྒྱ་མཚོས་ཞུས་པ། བམ་པོ་བཅུ་པ་སྟེ་ཐ་མ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: The Blessed One then expressed his approval to the bodhisattva Sāgaramati: “Excellent, Sāgaramati, excellent.

source: བློ་གྲོས་རྒྱ་མཚོ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བདུད་ཀྱི་ལྕགས་ཀྱུ་འདི་དག་ལེགས་པར་བཤད་པ་ལེགས་སོ་ལེགས་སོ། །
en: You have explained well these hooks of Māra reserved for bodhisattvas.

source: བློ་གྲོས་རྒྱ་མཚོ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བྱང་ཆུབ་སེམས་དཔའ་དག་གང་ལ་གནས་ན་བདུད་ཀྱི་ལྕགས་ཀྱུ་ཐམས་ཅད་ལས་ཤིན་ཏུ་འདའ་བར་འགྱུར་བ་བདུད་ཀྱི་ལྕགས་ཀྱུ་རབ་ཏུ་གཅོད་པའི་ཆོས་ཀྱི་སྒོ་ཁྱོད་ལ་བཤད་དོ། །
en: Therefore, Sāgaramati, listen well and bear this in mind. I will explain to you the Dharma gateways through which bodhisattvas will always escape and destroy the hooks of Māra.

source: བློ་གྲོས་རྒྱ་མཚོ་བདུད་ཀྱི་ལྕགས་ཀྱུ་རབ་ཏུ་གཅོད་པའི་ཆོས་ཀྱི་སྒོ་དེ་དག་གང་ཞེ་ན།
en: Sāgaramati, what are the Dharma gateways that destroy the hooks of Māra?

source: བློ་གྲོས་རྒྱ་མཚོ་བཅུ་པོ་འདི་དག་ནི་བདུད་ཀྱི་ལྕགས་ཀྱུ་རབ་ཏུ་གཅོད་པའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: Sāgaramati, there are the following ten Dharma gateways that destroy the hooks of Māra.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་སྟོང་པ་ཉིད་ཀྱི་རང་བཞིན་པས་སྟོང་པ་ཉིད་ཀྱི་རྣམ་པར་ཞུགས་ཀྱང་བདག་ཉིད་སྐྱབས་བྱེད་པས།
en: “Sāgaramati, because all phenomena have the nature of emptiness, one can be absorbed in emptiness while still offering protection.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཆེར་བྱམས་པ་འདི་ནི་བདུད་ཀྱི་ལྕགས་ཀྱུ་རབ་ཏུ་གཅོད་པའི་ཆོས་ཀྱི་སྒོ་དང་པོའོ། །
en: So, to have great love for all beings is the first Dharma gateway that destroys the hooks of Māra.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་མཚན་མ་མེད་པའི་རང་བཞིན་པས་མཚན་མ་མེད་པའི་རྣམ་པར་ཞུགས་ཀྱང་ཡོངས་སུ་ཐར་བར་བྱེད་པས།
en: “Sāgaramati, because all phenomena have the nature of signlessness, one can be absorbed in signlessness while bringing freedom.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཆེར་སྙིང་རྗེ་བ་འདི་ནི་བདུད་ཀྱི་ལྕགས་ཀྱུ་རབ་ཏུ་གཅོད་པའི་ཆོས་ཀྱི་སྒོ་གཉིས་པའོ། །
en: So, to have great compassion for all beings is the second Dharma gateway that destroys the hooks of Māra.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་སྨོན་པ་མེད་པའི་རང་བཞིན་པས་སྨོན་པ་མེད་པའི་རྣམ་པར་ཞུགས་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་བསམས་བཞིན་དུ་སྐྱེ་བ་
en: “Sāgaramati, because all phenomena have the nature of wishlessness, one can be absorbed in wishlessness while intentionally taking birth in order to ripen all beings.

source: འདི་ནི་བདུད་ཀྱི་ལྕགས་ཀྱུ་རབ་ཏུ་གཅོད་པའི་ཆོས་ཀྱི་སྒོ་གསུམ་པའོ། །
en: This is the third Dharma gateway that destroys the hooks of Māra.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་འདོད་ཆགས་དང་བྲལ་བའི་རང་བཞིན་པས་འདོད་ཆགས་དང་བྲལ་བའི་རྣམ་པར་ཞུགས་ཀྱང་འདོད་ཆགས་ལ་སྤྱོད་པའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་
en: “Sāgaramati, because all phenomena are naturally devoid of attachment, one can be absorbed in nonattachment while ripening beings who indulge in attachment.

source: འདི་ནི་བདུད་ཀྱི་ལྕགས་ཀྱུ་རབ་ཏུ་གཅོད་པའི་ཆོས་ཀྱི་སྒོ་བཞི་པའོ། །
en: This is the fourth Dharma gateway that destroys the hooks of Māra.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་ཞེ་སྡང་དང་བྲལ་བའི་རང་བཞིན་པས་ཞེ་སྡང་དང་བྲལ་བའི་རྣམ་པར་ཞུགས་ཀྱང་ཞེ་སྡང་ལ་སྤྱོད་པའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་
en: “Sāgaramati, because all phenomena are naturally devoid of aggression, one can be absorbed in nonaggression while ripening beings who indulge in aggression.

source: འདི་ནི་བདུད་ཀྱི་ལྕགས་ཀྱུ་རབ་ཏུ་གཅོད་པའི་ཆོས་ཀྱི་སྒོ་ལྔ་པའོ། །
en: This is the fifth Dharma gateway that destroys the hooks of Māra.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་གཏི་མུག་དང་བྲལ་བའི་རང་བཞིན་པས་གཏི་མུག་དང་བྲལ་བའི་རྣམ་པར་ཞུགས་ཀྱང་གཏི་མུག་ལ་སྤྱོད་པའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་
en: “Sāgaramati, because all phenomena are naturally devoid of stupidity, one can be absorbed in non-stupidity while ripening beings who indulge in stupidity.

source: འདི་ནི་བདུད་ཀྱི་ལྕགས་ཀྱུ་རབ་ཏུ་གཅོད་པའི་ཆོས་ཀྱི་སྒོ་དྲུག་པའོ། །
en: This is the sixth Dharma gateway that destroys the hooks of Māra.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པའི་རང་བཞིན་པས་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པའི་རྣམ་པར་ཞུགས་ཀྱང་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་གྱི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་
en: “Sāgaramati, because all phenomena are naturally free of being afflicted, one can be absorbed in not being afflicted while ripening beings who are afflicted.

source: འདི་ནི་བདུད་ཀྱི་ལྕགས་ཀྱུ་རབ་ཏུ་གཅོད་པའི་ཆོས་ཀྱི་སྒོ་བདུན་པའོ། །
en: This is the seventh Dharma gateway that destroys the hooks of Māra.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་སྐྱེ་བ་མེད་ཅིང་འབྱུང་བ་མེད་པའི་རང་བཞིན་པས་སྐྱེ་བ་མེད་ཅིང་འབྱུང་བ་མེད་པའི་རྣམ་པར་ཞུགས་ཀྱང་། སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་སྤོང་བའི་ཕྱིར་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་པ་
en: “Sāgaramati, because all phenomena are naturally unborn and non-arising, one can be absorbed in the unborn and non-arising while teaching the Dharma to beings so they may discard birth, aging, sickness, and death.

source: འདི་ནི་བདུད་ཀྱི་ལྕགས་ཀྱུ་རབ་ཏུ་གཅོད་པའི་ཆོས་ཀྱི་སྒོ་བརྒྱད་པའོ། །
en: This is the eighth Dharma gateway that destroys the hooks of Māra.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་ངང་མཉམ་ཞིང་བྱེ་བྲག་མེད་པའི་རང་བཞིན་པས་ངང་མཉམ་ཞིང་བྱེ་བྲག་མེད་པའི་རྣམ་པར་ཞུགས་ཀྱང་ཐེག་པ་ཆེན་པོའི་བསམ་པ་ཡོངས་སུ་མི་འདོར་བར་སེམས་ཅན་རྣམས་ལ་ཐེག་པ་གསུམ་རྣམ་པར་དགོད་པའི་ཆོས་སྟོན་པ་
en: “Sāgaramati, because all phenomena are by nature undifferentiated and of equal status, one can be absorbed in an undifferentiated state of equality while teaching the Dharma in order to establish all beings in the three vehicles, without giving up the Great Vehicle attitude.

source: འདི་ནི་བདུད་ཀྱི་ལྕགས་ཀྱུ་རབ་ཏུ་གཅོད་པའི་ཆོས་ཀྱི་སྒོ་དགུ་པའོ། །
en: This is the ninth Dharma gateway that destroys the hooks of Māra.

source: བློ་གྲོས་རྒྱ་མཚོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དང་ཡིད་དང་རྣམ་པར་ཤེས་པ་ལ་ཡང་མི་གནས་ལ། བྱང་ཆུབ་ཀྱི་སེམས་ཀྱང་མི་བརྗེད། རྩོམ་པ་ཐམས་ཅད་དང་ཡང་བྲལ་ལ་སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་ཐར་བར་བྱ་བའི་རྩོམ་པ་ཡང་མི་འདོར། སྤྱོད་པ་ཐམས་ཅད་ལས་ཀྱང་ཤིན་ཏུ་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལས་ཀྱང་མི་ལྡོག་པ་
en: “Sāgaramati, when a bodhisattva does not perpetuate mind, cognition, or consciousness; does not forget the mind of awakening; is free from all endeavors, yet does not give up the activity that frees beings; and transcends all activity without turning back from bodhisattva activity,

source: འདི་ནི། བློ་གྲོས་རྒྱ་མཚོ་བྱང་ཆུབ་སེམས་དཔའི་བདུད་ཀྱི་ལྕགས་ཀྱུ་རབ་ཏུ་གཅོད་པའི་ཆོས་ཀྱི་སྒོ་བཅུ་པའོ། །
en: this is the tenth Dharma gateway that destroys the hooks of Māra.

source: བློ་གྲོས་རྒྱ་མཚོ་བཅུ་པོ་འདི་དག་ནི་བདུད་ཀྱི་ལྕགས་ཀྱུ་རབ་ཏུ་གཅོད་པའི་ཆོས་ཀྱི་སྒོ་སྟེ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་རབ་ཏུ་སྦྱོར་ན་བདུད་ཀྱི་ལྕགས་ཀྱུ་ཐམས་ཅད་ལས་ཤིན་ཏུ་འདས་པར་འགྱུར་རོ། །
en: “Sāgaramati, these ten are the Dharma gateways that destroy the hooks of Māra. If bodhisattvas apply themselves to these, they will escape all of Māra’s hooks.”

source: བདུད་ཀྱི་ལྕགས་ཀྱུ་རབ་ཏུ་གཅོད་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན། བདུད་ཀྱི་གནས་ཐམས་ཅད་མོག་མོག་པོར་གྱུར་ཏེ་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ། །
en: When this Dharma teaching that destroys the hooks of Māra was expressed, all the realms of Māra were eclipsed and shook in six ways.

source: འདི་ལྟ་སྟེ། དཔེར་ན། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པའི་བྱང་ཆུབ་སེམས་དཔའི་མཛོད་སྤུ་ནས་འོད་རབ་ཏུ་བྱུང་བས་བདུད་ཀྱི་གནས་ཐམས་ཅད་མོག་མོག་པོར་གྱུར་པ་
en: It was like how, when light streams forth from the ūrṇa hair of the Bodhisattva seated at the seat of awakening, all the realms of Māra are eclipsed.

source: དེ་བཞིན་དུ་དེའི་ཚེ་བདུད་ཀྱི་གནས་ཐམས་ཅད་མོག་མོག་པོར་གྱུར་ཏོ། །
en: Analogously, at this time all the realms of Māra were eclipsed.

source: དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་ལྟས་རྒྱ་ཆེན་པོ་འདི་མཐོང་ནས་རིངས་ཤིང་མྱུར་བར་ལ་གོར་དུ་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་བསྡུས་ཏེ།
en: Then, when the evil Māra witnessed this spectacle, he quickly, swiftly, and without delay gathered the four divisions of his forces.

source: བཀོད་པ་ཅི་འདྲ་བས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པའི་བྱང་ཆུབ་སེམས་དཔའི་གན་དུ་འགྲོ་བའི་བཀོད་པ་དེ་འདྲ་བའི་དཔག་ཚད་སུམ་ཅུ་རྩ་དྲུག་ཚུན་ཆད་བདུད་ཀྱི་སྡེས་བཀང་ནས་བཅོམ་ལྡན་འདས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་ཁྱམས་ག་ལ་བ་དེར་དོང་བ་དང་།
en: Just as they gather in formation when they go near the Bodhisattva seated at the seat of awakening, the legions of Māra filled an area thirty-six leagues in diameter as they approached the assembly of the Blessed One.

source: སངས་རྒྱས་ཀྱི་མཐུས་དེར་དེས་བསྒྲིམས་པར་གྱུར་ཏེ
en: They were forced there by the power of the Buddha.

source: འོངས་ཀྱང་དེ་བཞིན་གཤེགས་པ་དང་། གང་དག་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། འཁོར་དེ་ལས་སེམས་ཅན་གང་དག་འདུལ་བར་གྱུར་པ་རྣམས་དང་། གང་དག་སྲིད་པར་ཀུན་ཏུ་སྦྱོར་བ་སྤངས་པའི་དགྲ་བཅོམ་པ་ལྟ་བ་ཕུན་སུམ་ཚོགས་པའི་གང་ཟག་རྣམས་མ་གཏོགས་པར་གང་གིས་ཀྱང་དེ་མ་མཐོང་ངོ་། །
en: However, even though they were actually there, they were invisible to anyone but the Thus-Gone One and the bodhisattvas who are irreversibly destined for awakening, as well as those worthy ones in the assembly who had tamed their minds, abandoned all ties to existence, and possessed the perfect view.

source: བློ་གྲོས་རྒྱ་མཚོ་ཁྱོད་ཀྱིས་བདུད་སྡིག་ཅན་བཀོད་པ་ཇི་ལྟ་བུ་དང་ལྡན་པས་འོང་བ་མཐོང་ངམ།
en: “Can you see the evil Māra and his display, Sāgaramati?”

source: གསོལ་པ་བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ། །
en: “Blessed One, I see them.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བློ་གྲོས་རྒྱ་མཚོ་བདུད་སྡིག་ཅན་འདི་ནི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་བར་ཆད་བྱ་བའི་ཕྱིར་འོངས་ན་འདི་ཅི་ཞིག་བྱ།
en: “Sāgaramati,” asked the Blessed One, “what should be done now that the evil Māra has come here to obstruct this Dharma teaching?”

source: གསོལ་པ་བཅོམ་ལྡན་འདས་དེང་འདི་བདེ་བ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་འཕང་བར་བགྱིའོ། །
en: “Blessed One, he should be expelled to the world Adorned with Every Pleasure.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then the venerable Śāradvatīputra asked the bodhisattva Sāgaramati,

source: རིགས་ཀྱི་བུ་བདེ་བ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ནི་ག་ལ་ཡོད།
en: “Noble son, where is the world Adorned with Every Pleasure?

source: དེ་ན་ཆོས་སྟོན་པའི་དེ་བཞིན་གཤེགས་པའི་མཚན་ནི་ཅི་ཞིག་བྱ།
en: What is the name of the thus-gone one who teaches the Dharma there?”

source: བློ་གྲོས་རྒྱ་མཚོས་སྨྲས་པ། བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་གང་གཱའི་ཀླུང་བཅུ་གཉིས་ཀྱི་བྱེ་མ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འདས་པ་ན་བདེ་བ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་ཞེས་བྱ་བའི་འཇིག་རྟེན་གྱི་ཁམས་ཡོད་དེ
en: “Venerable Śāradvatīputra,” replied Sāgaramati, “the world system Adorned with Every Pleasure is out beyond buddha realms numbering twelve times the grains of sand in the Ganges to the east of this buddha realm.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བདུད་རབ་ཏུ་འཇོམས་པ་ཞེས་བྱ་བ་ཆོས་སྟོན་ཏོ། །
en: There the thus-gone, worthy, perfect buddha Mārapramardaka is teaching the Dharma.

source: ཅིའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་དེ་བདེ་བ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་ཞེས་བྱ་ཞེ་ན།
en: Why is this world system called Adorned with Every Pleasure?

source: བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བདེ་བ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་བདེ་བའི་རྒྱུ་དང་། ཡོན་ཏན་གྱི་རྒྱུ་དང་། བཀོད་པའི་རྒྱུ་བསྐལ་པར་བརྗོད་ཀྱང་ཟད་པར་མི་ནུས་ཏེ
en: Venerable Śāradvatīputra, even given an eon, I could not fully express the pleasures, qualities, and manifestations in the world system Adorned with Every Pleasure.

source: དེའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་དེ་བདེ་བ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་ཞེས་བྱའོ། །
en: Therefore, that world system is called Adorned with Every Pleasure.

source: གང་གི་ཚེ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བདུད་རབ་ཏུ་འཇོམས་པ་དེས་བྱང་ཆུབ་ཐོབ་པ་དེའི་ཚེ། དེ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་སྟེ།
en: “When the blessed, thus-gone, worthy, perfect buddha Mārapramardaka attained awakening, he was seated at the seat of awakening.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་ཐོབ་པར་ལུས་ལས་བདུད་ཀུན་ཏུ་སྐུལ་བ་ཞེས་བྱ་བའི་འོད་ཟེར་བྱུང་ནས་
en: Before he attained omniscience, light rays called ‘summoners of Māra’ issued forth from his body.

source: འོད་ཟེར་དེས་བསྐུལ་བས་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་བདུད་བྱེ་བ་ཕྲག་བརྒྱ་འཁོད་པའི་བདུད་རེ་རེ་ཞིང་ཡང་གཡོག་འཁོར་བྱེ་བ་བརྒྱ་ཕྲག་བཅུ་ཡོད་པ། དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ག་ལ་བ་དེར་སོང་སྟེ་
en: Summoned by this light, every single one of the billions of māras in that universe and each of their ten-billionfold retinues came to the seat of awakening and set about trying to obstruct the bodhisattva.

source: ཕྱིན་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལ་བར་ཆད་བྱ་བར་བརྩམས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལ་བར་ཆད་བྱེད་མ་ནུས་ཏེ།
en: However, being unable to dissuade him, they were filled with shame and so touched the feet of that blessed one.

source: དེ་དག་ངོ་མཚར་དུ་གྱུར་ནས་བཅོམ་ལྡན་འདས་དེའི་ཞབས་གཉིས་ལ་གཏུགས་སོ། །དེས་ཀྱང་ཇི་ལྟ་ཇི་ལྟར་དེ་དག་བསམ་པ་ཐག་པ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་བདུད་དེ་དག་ལ་ཆོས་བསྟན་ནས་
en: As they gave rise to the mind set upon unsurpassed and perfect awakening from the bottom of their hearts, he then taught them the Dharma, after which he attained awakening.

source: བཅོམ་ལྡན་འདས་དེ་ཕྱིས་བྱང་ཆུབ་ཐོབ་སྟེདེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེ་བདུད་རབ་ཏུ་འཇོམས་པ་ཞེས་བྱའོ།
en: Thus, this thus-gone one is called Mārapramardaka.

source: དེ་བྱང་ཆུབ་ཐོབ་པའི་མཆོག་གི་ཕྲུགས་དང་། བཟང་པོའི་ཕྲུགས་ཀྱང་བདུད་ལས་བཏུལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སོ། །
en: Moreover, in the supreme and excellent group that attained awakening were also bodhisattvas who had been converted from among the māras.

source: རིམ་གྲོ་བ་ཡང་བདུད་ལས་བཏུལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སོ། །
en: Even those who served him were bodhisattvas who had been converted from among the māras.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བདུད་རབ་ཏུ་འཇོམས་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་གཏམ་འབའ་ཞིག་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏེ།
en: The blessed thus-gone Mārapramardaka solely taught the bodhisattva teachings.

source: དེ་ན་ཐེག་པ་གཞན་གྱི་མིང་ཡང་མེད་དོ། །
en: The name of any other vehicle was not even heard of.

source: བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བདེ་བ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ནི་དེ་འདྲ་སྟེ།
en: Venerable Śāradvatīputra, this is what the world Adorned with Every Pleasure is like.

source: དེར་འཕངས་ན་ཕྱིས་བདུད་ཀྱི་ལས་བྱེད་པར་མི་འགྱུར་གྱི།
en: So, if they were sent there, these māras could no longer function.”

source: བདུད་ལས་བཏུལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་ལྷན་ཅིག་ཏུ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: The bodhisattvas who had been converted from among the māras simultaneously developed the mind directed toward unsurpassed and perfect awakening and perfected the qualities directed toward awakening.

source: དེ་ནས་བདུད་སྡིག་ཅན་དངངས་སྐྲག་འཇིགས་ཏེ།
en: The remaining evil māras became scared and their hair bristled.

source: སྤུ་ཟིང་ཞེས་བྱེད་ནས། འཁོར་དེ་ནས་འགྲོ་བར་འདོད་ན་འགྲོ་མ་ནུས་ཏེ་
en: They wished to escape the gathering but could not.

source: མི་སྣང་བར་མ་གྱུར་ན། དེ་དེ་བས་ཀྱང་ཆེར་དངངས་ཤིང་སྐྲག་སྟེ།
en: They could not disappear, and so their terror only increased.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་གཏུགས་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Touching the Blessed One’s feet, they pleaded,
